nxp-mcuxpresso/mcux-soc-svd/KW47B42Z96/KW47B42Z96_cm33_core0.xml
        <register>
          <name>CIU2_CLK_LBU2_BTRTU1_CTRL</name>
          <description>LBU2 BT_RTU1 Clock Control</description>
          <addressOffset>0x110</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>lbu2_use_refclk</name>
              <description>Static bit set by FW based on Reference Clock Frequency. If reference clock frequency is lower and LBU can not support high baud rate of UART, then FW will set soc_use_ref_mode = 0. This is an indication for Bluetooth subsystem that there is some IP which need PLL to function which is LBU in this case.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>btrtu1_timer1_use_slp_clk</name>
              <description>Timer 1 BT_RTU1 Clock</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>btrtu1_use_ref_clk</name>
              <description>Static bit set by FW. If it is required that timers need not be programmed with dynamic switching of T1/Reference, the BT_RTU1 source clock is set on reference clock so that the timer are not distrubed.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>btrtu1_dbg_clk_ctrl</name>
              <description>1= Enable BT_RTU1 timers turn off during debugger mode 0= This feature is disabled</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CIU2_CLK_CP15_DIS3</name>
          <description>Clock Auto Shut-off Enable3</description>
          <addressOffset>0x118</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>br_ahb2_clk</name>
              <description>BRU_AHB2 Shut Off</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>imem_ahb2_clk</name>
              <description>IMEM_AHB2 Shut Off</description>
              <bitOffset>21</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>dmem_ahb2_clk</name>
              <description>DMEM_AHB2 Shut Off</description>
              <bitOffset>25</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>arb_ahb2_clk</name>
              <description>AHB2 Arbiter Shut Off</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>dec_ahb2_clk</name>
              <description>AHB2 Decoder Shut Off</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>btu_ahb_clk</name>
              <description>BTU Shut Off</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ble_ahb_clk</name>
              <description>BLE Shut Off</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CIU2_RST_SW3</name>
          <description>Software Module Reset</description>
          <addressOffset>0x11C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0xE45D0FB7</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>btu_ahb_clk_</name>
              <description>BTU (ARM_Clk) Soft Reset</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ble_soc_</name>
              <description>BLE SoC Soft Reset</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>bt_common_</name>
              <description>BT Common Soft Rest</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>cpu2_core_</name>
              <description>CPU2 core reset</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>cpu2_tcm_</name>
              <description>CPU2 TCM/DMA/Arbiter reset</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>arb_ahb2_clk_</name>
              <description>AHB2 Arbiter Soft Reset</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>dec_ahb2_clk_</name>
              <description>AHB2 Decoder Mux Soft Reset</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>bru_ahb2_clk_</name>
              <description>BRU_AHB2 Soft Reset</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>bt_uart_n</name>
              <description>BT UART soft reset</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>siu_ahb2_clk_n</name>
              <description>BT SIU (UART) AHB soft reset</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>smu2_ahb_clk_</name>
              <description>SMU2 (AHB_Clk) Soft Reset</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>sif_</name>
              <description>sif clock Soft Reset</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>sif_ahb2_clk_</name>
              <description>sif ahb2 Clock Soft Reset</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>hpu2_</name>
              <description>HPU2 Reset</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ciu2_ahb_clk_</name>
              <description>CIU2 AHB Soft Reset</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>brf_pr_</name>
              <description>BRF_PR Reset</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>wd2_chip_rst_disable</name>
              <description>1: Disable the rtu2 watchdog reset to reset the chip 0: Enable</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>wd2_cpu2_rst_disable</name>
              <description>1: Disable the rtu2 watchdog reset to reset the CPU2 0: Enable</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>bt_16m_clk_</name>
              <description>Bt 16M clock reset</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>bt_adma_</name>
              <description>BT ADMA Soft Reset</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CIU2_MEM_WRTC3</name>
          <description>Memory WRTC Control 3</description>
          <addressOffset>0x120</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x2600</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ble_rom_rtc</name>
              <description>BLE ROM RTC</description>
              <bitOffset>8</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ble_rom_rtc_ref</name>
              <description>BLE ROM RTC_REF</description>
              <bitOffset>12</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CIU2_MEM_WRTC4</name>
          <description>Memory WRTC Control 4</description>
          <addressOffset>0x124</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x14166555</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>cpu2_itcm_rtc</name>
              <description>CPU2 ITCM RTC</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>cpu2_itcm_wtc</name>
              <description>CPU2 ITCM WTC</description>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>cpu2_dtcm_rtc</name>
              <description>CPU2 DTCM RTC</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>cpu2_dtcm_wtc</name>
              <description>CPU2 DTCM WTC</description>
              <bitOffset>6</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>smu2_rtc</name>
              <description>SMU2 RTC</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>smu2_wtc</name>
              <description>SMU2 WTC</description>
              <bitOffset>10</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>cpu2_bru_rtc</name>
              <description>CPU2 BROM RTC</description>
              <bitOffset>12</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>cpu2_bru_rtc_ref</name>
              <description>CPU2 BROM RTC_REF</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>btu_rtc</name>
              <description>BTU EBRAM RTC</description>
              <bitOffset>18</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>btu_wtc</name>
              <description>BTU EBRAM WTC</description>
              <bitOffset>20</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ble_rtc</name>
              <description>ble RTC</description>
              <bitOffset>26</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ble_wtc</name>
              <description>ble WTC</description>
              <bitOffset>28</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CIU2_MEM_PWDN3</name>
          <description>Memory Powerdown Control</description>
          <addressOffset>0x128</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x2770000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>cpu2_bru_bypass_val</name>
              <description>Firmware Bypass value for CPU2 Boot ROM Memories Power Down</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>cpu2_dtcm_bypass_val</name>
              <description>Firmware Bypass value for CPU2 DTCM Memories Power Down</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>cpu2_itcm_bypass_val</name>
              <description>Firmware Bypass value for CPU2 ITCM Memories Power Down</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>smu2_bypass_val</name>
              <description>Firmware Bypass value for SMU2 Memories Power Down</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>siu_bypass_val</name>
              <description>Firmware Bypass value for UART Memories Power Down</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>btu_bypass_val</name>
              <description>Firmware Bypass value for BTU Memories Power Down</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>bt_adma_bypass_val</name>
              <description>Firmware Bypass value for BT ADMA Memories Power Down</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>cpu2_bru_bypass_en</name>
              <description>Firmware Bypass Enable for CPU2 Boot ROM Memories Power Down</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>cpu2_dtcm_bypass_en</name>
              <description>Firmware Bypass Enable for CPU2 DTCM Memories Power Down</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>cpu2_itcm_bypass_en</name>
              <description>Firmware Bypass Enable for CPU2 ITCM Memories Power Down</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>smu2_bypass_en</name>
              <description>Firmware Bypass Enable for SMU2 Memories Power Down</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>siu_bypass_en</name>
              <description>Firmware Bypass Enable for UART Memories Power Down</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>btu_bypass_en</name>
              <description>Firmware Bypass Enable for BTU Memories Power Down</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>bt_adma_bypass_en</name>
              <description>Firmware Bypass Enable for BT ADMA Memories Power Down</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CIU2_BLE_CTRL</name>
          <description>BLE Control and Status</description>
          <addressOffset>0x140</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>bt_aes_clk_freq_sel</name>
              <description>btu_aes_clk Frequency Select</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CIU2_AHB2_TO_LAST_ADDR</name>
          <description>AHB2 Timeout Last Address</description>
          <addressOffset>0x144</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>address</name>
              <description>Last AHB2 Address Right Before the Current Timeout</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CIU2_AHB2_TO_CUR_ADDR</name>
          <description>AHB2 Current Timeout Address</description>
          <addressOffset>0x148</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>address</name>
              <description>Current_TO_Addr</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CIU2_AHB2_TO_CTRL</name>
          <description>AHB2 ARB Control</description>
          <addressOffset>0x14C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x70000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>current_to_slave_id</name>
              <description>Current_TO_Slave_ID</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>last_to_slave_id</name>
              <description>Last_TO_Slave_ID</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>current_to_master_id</name>
              <description>AHB2 Current_TO_Master_ID</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>last_to_master_id</name>
              <description>AHB2 Last_TO_Master_ID</description>
              <bitOffset>12</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ahb2_smu1_mem_prot_dis</name>
              <description>Disable SMU1 Memory Protection from AHB2 side</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ahb2_cpu2_imem_prot_dis</name>
              <description>1 = Disable CPU2 Imem Memory Protection from AHB2 side and allow AHB2 to read/write Imem</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ahb2_cpu2_dmem_prot_dis</name>
              <description>1 = Disable CPU2 Dmem Memory Protection from AHB2 side and allow AHB2 to read/write Dmem</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ahb2_timeout_mode</name>
              <description>AHB2_TimeoutMode[1:0]</description>
              <bitOffset>30</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
