nxp-mcuxpresso/mcux-soc-svd/KW47B42Z96/KW47B42Z96_cm33_core0.xml
        <register>
          <name>CIU2_BTU_ECO_CTRL</name>
          <description>BTU ECO Control</description>
          <addressOffset>0x198</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0xAAAAAAAA</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>eco_bits</name>
              <description>Reserved</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CIU2_INT_MASK</name>
          <description>CIU2 Interrupt Mask</description>
          <addressOffset>0x1A0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>mask</name>
              <description>Interrupt Mask for CIU2 Interrupts</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CIU2_INT_SELECT</name>
          <description>CIU2 Interrupt Select</description>
          <addressOffset>0x1A4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>sel</name>
              <description>Interrupt Read/Write Clear for CIU2 Interrupts</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CIU2_INT_EVENT_MASK</name>
          <description>CIU2 Interrupt Event Mask</description>
          <addressOffset>0x1A8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>mask</name>
              <description>Interrupt Event Mask for CIU2 Interrupts</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CIU2_INT_STATUS</name>
          <description>CIU2 Interrupt Status</description>
          <addressOffset>0x1AC</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ciu_isr</name>
              <description>CIU2 Interrupt Status (ISR)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CPU2_ERR_INT_MASK</name>
          <description>CPU2 ERR Interrupt Mask</description>
          <addressOffset>0x1B0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>mask</name>
              <description>Interrupt Mask for CPU2 ERR Interrupts</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CPU2_ERR_INT_SELECT</name>
          <description>CPU2 ERR Interrupt Clear Select</description>
          <addressOffset>0x1B4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>sel</name>
              <description>Interrupt Read/Write Clear for CPU2 ERR Interrupts</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CPU2_ERR_INT_EVENT_MASK</name>
          <description>CPU2 ERR Interrupt Event Mask</description>
          <addressOffset>0x1B8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>mask</name>
              <description>Interrupt Event Mask for CPU2 ERR Interrupts</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CPU2_ERR_INT_STATUS</name>
          <description>CPU2 ERR Interrupt Status</description>
          <addressOffset>0x1BC</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>err_isr</name>
              <description>CPU2 ERR Interrupt Status (ISR)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CPU2_ERR_INT2_MASK</name>
          <description>CPU2 ERR Interrupt 2 Mask</description>
          <addressOffset>0x1C0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>mask</name>
              <description>Interrupt Mask for CPU2 ERR Interrupts 2</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CPU2_ERR_INT2_SELECT</name>
          <description>CPU2 ERR Interrupt 2 Clear Select</description>
          <addressOffset>0x1C4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>sel</name>
              <description>Interrupt Read/Write Clear for CPU2 ERR Interrupts 2</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CPU2_ERR_INT2_EVENT_MASK</name>
          <description>CPU2 ERR Interrupt 2 Event Mask</description>
          <addressOffset>0x1C8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>mask</name>
              <description>Interrupt Event Mask for CPU2 ERR Interrupts 2</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CPU2_ERR_INT2_STATUS</name>
          <description>CPU2 ERR Interrupt 2 Status</description>
          <addressOffset>0x1CC</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>err_isr</name>
              <description>CPU1 ERR Interrupt 2 Status (ISR)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CIU2_CPU_CPU2_MSG_CTRL</name>
          <description>CPU2 message register</description>
          <addressOffset>0x1D0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>cpu1_to_cpu2_msg_rdy</name>
              <description>CPU1 Message for CPU2 is ready. This is self clearing bit. The CPU1 writes 1 to indicate that message for CPU2 is ready. This generates an Interrupt to CPU2 via APU. This is old schem and we should use IMU based scheme.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>cpu3_to_cpu2_msg_rdy</name>
              <description>CPU3 Message for CPU2 is ready. This is self clearing bit. The CPU3 writes 1 to indicate that message for CPU2 is ready. This generates an Interrupt to CPU2 via APU. This is old schem and we should use IMU based scheme.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>cpu1_to_cpu2_msg_process_done</name>
              <description>CPU1 Message for CPU2 has been read by CPU2 and executed. This is self clearing bit. The CPU2 writes 1 to indicate that message send by CPU1 is executed. This generates an Interrupt to CPU1 via CIU1.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>cpu3_to_cpu2_msg_process_done</name>
              <description>CPU3 Message for CPU2 has been read by CPU2 and executed. This is self clearing bit. The CPU2 writes 1 to indicate that message send by CPU3 is executed. This generates an Interrupt to CPU3 via CIU3.</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CIU2_IMU_CPU1_WR_MSG_TO_CPU2</name>
          <description>CPU1 write message to CPU2</description>
          <addressOffset>0x1D4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>cpu1_wr_msg_cpu2</name>
              <description>Write CPU1 message data to CPU2 (push to FIFO)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CIU2_IMU_CPU1_RD_MSG_FROM_CPU2</name>
          <description>CPU1 read message from CPU2</description>
          <addressOffset>0x1D8</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>cpu1_rd_msg_cpu2</name>
              <description>CPU1 read message data from CPU2 (pop from FIFO)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CIU2_IMU_CPU1_CPU2_MSG_FIFO_STATUS</name>
          <description>CPU1 to CPU2 message FIFO status</description>
          <addressOffset>0x1DC</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>cpu1_to_cpu2_msg_fifo_locked</name>
              <description>cpu1_to_cpu2_msg_fifo_locked</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>cpu1_to_cpu2_msg_fifo_almost_full</name>
              <description>cpu1_to_cpu2_msg_fifo_almost_full (based upon FIFO watermark)</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>cpu1_to_cpu2_msg_fifo_full</name>
              <description>cpu1_to_cpu2_msg_fifo_full (based upon FIFO depth)</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>cpu1_to_cpu2_msg_fifo_empty</name>
              <description>cpu1_to_cpu2_msg_fifo_empty</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>cpu1_to_cpu2_msg_count</name>
              <description>cpu1_to_cpu2_msg_count</description>
              <bitOffset>4</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>cpu1_to_cpu2_msg_fifo_wr_ptr</name>
              <description>cpu1 to cpu2 msg fifo write pointer for debug</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>cpu1_to_cpu2_msg_fifo_rd_ptr</name>
              <description>cpu1 to cpu2 msg fifo read pointer for debug</description>
              <bitOffset>20</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CIU2_IMU_CPU1_CPU2_MSG_FIFO_CNTL</name>
          <description>CPU1 to CPU2 message FIFO control</description>
          <addressOffset>0x1E0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0xF00000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>cpu1_msg_rdy_int_clr</name>
              <description>Writing 1 to this bit will clear message ready interrupt to CPU1 (self clear bit)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>cpu1_msg_sp_av_int_clr</name>
              <description>Writing 1 to this bit will clear message space available interrupt to CPU1 (self clear bit)</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>cpu1_to_cpu2_msg_fifo_flush</name>
              <description>Writing 1 to this bit will flush cpu1_to_cpu2 message fifo</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>cpu1_wait_for_ack</name>
              <description>1: CPU1 will wait for an ack for the next message to be written to CPU2 0: CPU1 will not wat for an ack for next message to be written to CPU2</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>cpu1_cpu2_msg_fifo_full_watermark</name>
              <description>cpu1_to_cpu2 message fifo full watermark (space avail intr based upon it)</description>
              <bitOffset>20</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CIU2_IMU_CPU2_RD_MSG_FROM_CPU1_VAL_DBG</name>
          <description>CPU2 last message read (from cpu1)</description>
          <addressOffset>0x1E4</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>cpu2_rd_msg</name>
              <description>CPU2 last message read (from cpu1)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CIU2_IMU_CPU2_WR_MSG_TO_CPU1</name>
          <description>CPU2 write message to CPU1</description>
          <addressOffset>0x1E8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>cpu2_wr_msg_cpu1</name>
              <description>Write CPU2 message data to CPU1 (push to FIFO)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CIU2_IMU_CPU2_RD_MSG_FROM_CPU1</name>
          <description>CPU2 read message from CPU1</description>
          <addressOffset>0x1EC</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>cpu2_rd_msg_cpu1</name>
              <description>CPU2 read message data from CPU1 (pop from FIFO)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CIU2_IMU_CPU2_CPU1_MSG_FIFO_STATUS</name>
          <description>CPU2 to CPU1 message FIFO status</description>
          <addressOffset>0x1F0</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>cpu2_to_cpu1_msg_fifo_locked</name>
              <description>cpu2_to_cpu1_msg_fifo_locked</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>cpu2_to_cpu1_msg_fifo_almost_full</name>
              <description>cpu2_to_cpu1_msg_fifo_almost_full (based upon FIFO watermark)</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>cpu2_to_cpu1_msg_fifo_full</name>
              <description>cpu2_to_cpu1_msg_fifo_full (based upon FIFO depth)</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>cpu2_to_cpu1_msg_fifo_empty</name>
              <description>cpu2_to_cpu1_msg_fifo_empty</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>cpu2_to_cpu1_msg_count</name>
              <description>cpu2_to_cpu1_msg_count</description>
              <bitOffset>4</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>cpu2_to_cpu1_msg_fifo_wr_ptr</name>
              <description>cpu1 to cpu2 msg fifo write pointer for debug</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>cpu2_to_cpu1_msg_fifo_rd_ptr</name>
              <description>cpu1 to cpu2 msg fifo read pointer for debug</description>
              <bitOffset>20</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CIU2_IMU_CPU2_CPU1_MSG_FIFO_CNTL</name>
          <description>CPU2 to CPU1 message FIFO control</description>
          <addressOffset>0x1F4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0xF00000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>cpu2_msg_rdy_int_clr</name>
              <description>Writing 1 to this bit will clear message ready interrupt to CPU2 (self clear bit)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>cpu2_msg_sp_av_int_clr</name>
              <description>Writing 1 to this bit will clear message space available interrupt to CPU2 (self clear bit)</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>cpu2_to_cpu1_msg_fifo_flush</name>
              <description>Writing 1 to this bit will flush cpu2_to_cpu1 message fifo</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>cpu2_wait_for_ack</name>
              <description>1: CPU2 will wait for an ack for the next message to be written to CPU1 0: CPU2 will not wat for an ack for next message to be written to CPU1</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>cpu2_cpu1_msg_fifo_full_watermark</name>
              <description>cpu2_to_cpu1 message fifo full watermark (space avail intr based upon it)</description>
              <bitOffset>20</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CIU2_IMU_CPU1_RD_MSG_FROM_CPU2_VAL_DBG</name>
          <description>CPU1 last message read (from cpu2)</description>
          <addressOffset>0x1F8</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>cpu1_rd_msg</name>
              <description>CPU1 last message read (from cpu2)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
