nxp-mcuxpresso/mcux-soc-svd/KW47B42Z96/KW47B42Z96_cm33_core0.xml
        <register>
          <name>RF_CLK_CTRL</name>
          <description>Radio Clock Control Register</description>
          <addressOffset>0xC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x801FFF00</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ZBLL_CLK_EN_OVRD</name>
              <description>ZBLL Clock Enable Override</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ZBLL_CLK_EN_OVRD_0</name>
                  <description>ZBLL clock force on is disabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ZBLL_CLK_EN_OVRD_1</name>
                  <description>ZBLL clock force on is enabled.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>GENLL_CLK_EN_OVRD</name>
              <description>GENLL Clock Enable Override</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>GENLL_CLK_EN_OVRD_0</name>
                  <description>GENLL clock force on is disabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GENLL_CLK_EN_OVRD_1</name>
                  <description>GENLL clock force on is enabled.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BTLL_CLK_EN_OVRD</name>
              <description>BTLL Clock Enable Override</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>BTLL_CLK_EN_OVRD_0</name>
                  <description>BTLL clock force on is disabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BTLL_CLK_EN_OVRD_1</name>
                  <description>BTLL clock force on is enabled.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BTU_EBRAM_CLK_ON_OVRD</name>
              <description>BTU EBRAM Clock Enable Override</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>BTU_EBRAM_CLK_ON_OVRD_0</name>
                  <description>btu_ebram_clk is not forced on.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BTU_EBRAM_CLK_ON_OVRD_1</name>
                  <description>btu_ebram_clk is forced on.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BT_ECLK_DIV</name>
              <description>BE_ECLK Divider</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>BT_ECLK_DIV_0</name>
                  <description>ref_clk is not divided as bt_eclk.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BT_ECLK_DIV_1</name>
                  <description>ref_clk is divided by 2 as bt_eclk.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>NBU_HCLK_EN</name>
              <description>NBU HCLK Enable</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NBU_HCLK_EN_0</name>
                  <description>nbu hclk/cpu_hclk are disabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NBU_HCLK_EN_1</name>
                  <description>nbu hclk/cpu_hclk are enabled.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CM3_HCLK_EN</name>
              <description>CM3 HCLK Enable</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CM3_HCLK_EN_0</name>
                  <description>cm3_hclk is disabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CM3_HCLK_EN_1</name>
                  <description>cm3_hclk is enabled.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BLE_AHB_CLK_EN</name>
              <description>BLE_AHB CLOCK Enable</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>BLE_AHB_CLK_EN_0</name>
                  <description>ble_ahb_clk is disabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BLE_AHB_CLK_EN_1</name>
                  <description>ble_ahb_clk is enabled.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>NBU_PKB_CLK_EN</name>
              <description>NBU PKB Clock Enable</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NBU_PKB_CLK_EN_0</name>
                  <description>nbu_pkb_clk is disabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NBU_PKB_CLK_EN_1</name>
                  <description>nbu_pkb_clk is enabled.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BT_16M_CLK_EN</name>
              <description>BT 16M Clock Enable</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>BT_16M_CLK_EN_0</name>
                  <description>bt_16m_clk is disabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BT_16M_CLK_EN_1</name>
                  <description>bt_16m_clk is enabled.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RTU_CLK_EN</name>
              <description>RTU Clock Enable</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RTU_CLK_EN_0</name>
                  <description>rtu_clk is disabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RTU_CLK_EN_1</name>
                  <description>rtu_clk is enabled.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BT_4M_CLK_EN</name>
              <description>BT 4M Clock Enable</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>BT_4M_CLK_EN_0</name>
                  <description>bt_4m_clk is disabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BT_4M_CLK_EN_1</name>
                  <description>bt_4m_clk is enabled.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BT_REF_4M_CLK_EN</name>
              <description>BT REF 4M Clock Enable</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>BT_REF_4M_CLK_EN_0</name>
                  <description>bt_ref_4m_clk is disabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BT_REF_4M_CLK_EN_1</name>
                  <description>bt_ref_4m_clk is enabled.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BT_XCVR_4M_CLK_EN</name>
              <description>BT XCVR 4M Clock Enable</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>BT_XCVR_4M_CLK_EN_0</name>
                  <description>bt_xcvr_4m_clk is disabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BT_XCVR_4M_CLK_EN_1</name>
                  <description>bt_xcvr_4m_clk is enabled.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BT_XCVR_32M_CLK_EN</name>
              <description>BT XCVR 32M Clock Enable</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>BT_XCVR_32M_CLK_EN_0</name>
                  <description>bt_xcvr_32m_clk is disabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BT_XCVR_32M_CLK_EN_1</name>
                  <description>bt_xcvr_32m_clk is enabled.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BT_ECLK_EN</name>
              <description>BT_ECLK Enable</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>BT_ECLK_EN_0</name>
                  <description>bt_eclk is disabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BT_ECLK_EN_1</name>
                  <description>bt_eclk is enabled.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BLE_AES_CLK_EN</name>
              <description>BLE_AES_CLK Enable</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>BLE_AES_CLK_EN_0</name>
                  <description>bt_aes_clk is disabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BLE_AES_CLK_EN_1</name>
                  <description>bt_aes_clk is enabled.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>UART_CLK_EN</name>
              <description>UART Clock Enable</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>UART_CLK_EN_0</name>
                  <description>uart_clk is disabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UART_CLK_EN_1</name>
                  <description>uart_clk is enabled.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MAN_DS_EN</name>
              <description>Manual deep sleep control enable</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MAN_DS_EN_0</name>
                  <description>Disable the control of rfmc_man_deep_sleep_enable for nbu_hclk.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MAN_DS_EN_1</name>
                  <description>Enable the control of rfmc_man_deep_sleep_enable for nbu_hclk.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WOR_DS_EN</name>
              <description>WOR deep sleep control enable</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>WOR_DS_EN_0</name>
                  <description>Disable the control of rfmc_wor_deep_sleep_enable for nbu_hclk.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WOR_DS_EN_1</name>
                  <description>Enable the control of rfmc_wor_deep_sleep_enable for nbu_hclk.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BT_CLK_REQ_EN</name>
              <description>BT_CLK_REQ control enable</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>BT_CLK_REQ_EN_0</name>
                  <description>Disable the control of bt_clk_req for nbu_hclk.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BT_CLK_REQ_EN_1</name>
                  <description>Enable the control of bt_clk_req for nbu_hclk.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
